local-PK/raw/res.mysql55/res.thr8.ro.txt
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from timer.

Random number generator seed is 0 and will be ignored

Forcing shutdown in 301 seconds

Initializing worker threads...

Threads started!

[  10s] threads: 8, tps: 0.00, reads: 135035.96, writes: 0.00, response time: 0.08ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 8, tps: 0.00, reads: 137218.19, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 8, tps: 0.00, reads: 137191.91, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 8, tps: 0.00, reads: 137483.95, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 8, tps: 0.00, reads: 136502.39, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 8, tps: 0.00, reads: 137582.28, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 8, tps: 0.00, reads: 138998.85, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 8, tps: 0.00, reads: 140853.95, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 8, tps: 0.00, reads: 137364.35, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 8, tps: 0.00, reads: 138501.15, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 8, tps: 0.00, reads: 139848.67, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 8, tps: 0.00, reads: 133535.81, writes: 0.00, response time: 0.08ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 8, tps: 0.00, reads: 134165.93, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 8, tps: 0.00, reads: 138517.89, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 8, tps: 0.00, reads: 138190.05, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 8, tps: 0.00, reads: 137727.37, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 8, tps: 0.00, reads: 138463.79, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 8, tps: 0.00, reads: 139341.23, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 8, tps: 0.00, reads: 139951.39, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 8, tps: 0.00, reads: 137949.38, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 8, tps: 0.00, reads: 138816.14, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 8, tps: 0.00, reads: 137431.23, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 8, tps: 0.00, reads: 137254.08, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 8, tps: 0.00, reads: 137239.13, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 8, tps: 0.00, reads: 138219.69, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 8, tps: 0.00, reads: 138299.90, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 8, tps: 0.00, reads: 138850.71, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 8, tps: 0.00, reads: 137852.57, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 8, tps: 0.00, reads: 138813.99, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
[ 300s] threads: 0, tps: 0.00, reads: 138259.23, writes: 0.00, response time: 0.07ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            41354619
        write:                           0
        other:                           0
        total:                           41354619
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 41354619 (137848.62 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0002s
    total number of events:              41354619
    total time taken by event execution: 2370.7406s
    response time:
         min:                                  0.04ms
         avg:                                  0.06ms
         max:                                  1.00ms
         approx.  95 percentile:               0.07ms

Threads fairness:
    events (avg/stddev):           5169327.3750/31425.68
    execution time (avg/stddev):   296.3426/0.06